app/controllers/dir_controller.rb

SELECT * FROM "directories" WHERE ("directories".directory_id = 614) LIMIT 50 OFFSET 0
---
  def index
    unless fragment_exist?(:action => "index", :page => params[:page])
      @top_dirs = Directory.paginate(:all, :conditions => ["directory_id is null"], :order => "name", :page => params[:page], :per_page => 50)

SELECT * FROM "directories" WHERE ("directories".directory_id = 617)
SELECT * FROM "pasokara_files" WHERE ("pasokara_files".directory_id = 617)
SELECT * FROM "directories" WHERE ("directories".directory_id = 614) LIMIT 10 OFFSET 0
SELECT * FROM "pasokara_files" WHERE ("pasokara_files".directory_id = 614) LIMIT 10 OFFSET 0
SELECT count(*) AS count_all FROM "directories" WHERE ("directories".directory_id = 614)
SELECT count(*) AS count_all FROM "pasokara_files" WHERE ("pasokara_files".directory_id = 614)
---
  def show
    unless params[:id]
      redirect_to :action => 'index' and return
    end

    @dir = Directory.find(params[:id], :include => :pasokara_files)
    unless fragment_exist?(:action => "show", :page => params[:page])
      @entities = @dir.entities.paginate(:page => params[:page], :per_page => 50)