app/controllers/pasokara_controller.rb

  def queue
    if params[:id] =~ /^\d+$/
      @pasokara = PasokaraFile.find(params[:id], :select => "id, name, nico_name, duration")
---
SELECT * FROM "pasokara_files" WHERE ("pasokara_files"."id" = 1539)

  def search
    @query = params[:query].respond_to?(:force_encoding) ? params[:query].force_encoding(Encoding::UTF_8) : params[:query]
    unless fragment_exist?(:query => @query, :page => params[:page])
      query_words = @query.split(/[\s　]/)
      conditions = query_words.inject([""]) {|cond_arr, query| cond_arr[0] += "name LIKE ? AND "; cond_arr << "%#{query}%"}
      conditions[0] = conditions[0][0..-6]

      order = order_options

      @pasokaras = PasokaraFile.union([{:conditions => conditions}.merge(pasokara_files_select), PasokaraFile.find_options_for_find_tagged_with(query_words, {:on => :tags, :match_all => true, :order => "name"}.merge(pasokara_files_select))], order)

      @pasokaras = @pasokaras.paginate(:page => params[:page], :per_page => per_page)
---
SELECT * FROM "pasokara_files" WHERE (fullpath LIKE '%石鹸屋%') ORDER BY name LIMIT 10 OFFSET 0
SELECT count(*) AS count_all FROM "pasokara_files" WHERE (fullpath LIKE '%石鹸屋%')