app/controllers/queue_controller.rb

SELECT * FROM "queued_files" ORDER BY created_at
---
  def list
    @queue_list = QueuedFile.paginate(:all, :order => "created_at", :include => :pasokara_file, :page => params[:page], :per_page => 50)

SELECT * FROM "queued_files" WHERE ("queued_files"."id" = 29)
DELETE FROM "queued_files" WHERE "id" = 29
---
  def remove
    @queue = QueuedFile.find(params[:id])
    @queue.destroy